"""
Главный модуль модели игры, содержащая мир, героя и все механики  
"""


from typing import Tuple


class World:  # FIXME
    """
    Основной класс игры, содержащий в себе текущую сцену, информацию о прогрессе игрока, героя и предметы.
    """

    def __init__(self) -> None:
        pass # FIXME

    def update(self):
        """
        Выполняет запрошенные команды, обновляет состояние объектов, продвигает сцену вперед по сюжету.
        """
        pass # FIXME

    def dispatch_command(cmd: str):
        """
        Отдает миру команду для какого-то действия.
        Принимает строку, пытается распознать в ней вызов какой-то заранее заданой команды и вызывает соответсвующий метод.
        Если команда не была распознана, должен вызывать сообщение о некоректности команды.
        Примеры предполагаемых команд: осмотреться, просмотреть свой инвентарь, ударить врага и т.д.
        - в качестве фичи можно преобразовывать ввод игрока во что-то стилизованное под запись в дневнике.

        returns: кортеж двух строк - (отформатированная команда, ответ игры на команду)
        """
        formated_command = "" # запись введенной команды в нужном формате
        responce = "" # ответ игры
        # FIXME
        return (formated_command, responce)
